
Процедура ОбработкаПроведения(Отказ, Режим) 
Запрос = Новый Запрос;

Запрос.Текст =
"ВЫБРАТЬ
|	ОстаткиЗанятийОстатки.КоличествоЗанятийОстаток КАК ОстатокЗанятий
|ИЗ
|	РегистрНакопления.ОстаткиЗанятий.Остатки(, Клиент = &Клиент	И ВидАбонемента = &ВидАбонемента)
|	КАК ОстаткиЗанятийОстатки";

Запрос.УстановитьПараметр("Клиент", Клиент);
Запрос.УстановитьПараметр("ВидАбонемента", ВидАбонемента);

РезультатЗапроса = Запрос.Выполнить();

ОстатокЗанятий = 0;  

Если РезультатЗапроса.Пустой() = Ложь Тогда
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ОстатокЗанятий = Выборка.ОстатокЗанятий;
КонецЕсли;

Если ОстатокЗанятий <= 0 Тогда
	Отказ = Истина;
	Сообщить("У клиента не осталось занятий по этому абонементу. Документ не проведён.");
	Возврат;
КонецЕсли;	     

	Движения.ОстаткиЗанятий.Записывать = Истина;
	Движение = Движения.ОстаткиЗанятий.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.ВидАбонемента = ВидАбонемента;
	Движение.КоличествоЗанятий = 1;

КонецПроцедуры
